mediaMicroservices/wrk2/_60s_r100.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 938.741ms, rate sampling interval: 3670ms
  Thread calibration: mean lat.: 644.492ms, rate sampling interval: 2789ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.17s     2.99s   11.46s    63.25%
    Req/Sec    41.00     12.66    53.00     80.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.39s 
 75.000%    6.19s 
 90.000%    8.27s 
 99.000%   11.46s 
 99.900%   13.65s 
 99.990%   13.77s 
 99.999%   13.77s 
100.000%   13.77s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      87.487     0.000000            1         1.00
     698.367     0.100000          410         1.11
    1350.655     0.200000          822         1.25
    1851.391     0.300000         1231         1.43
    2635.775     0.400000         1640         1.67
    3393.535     0.500000         2049         2.00
    4100.095     0.550000         2254         2.22
    4935.679     0.600000         2463         2.50
    5394.431     0.650000         2664         2.86
    5877.759     0.700000         2870         3.33
    6193.151     0.750000         3074         4.00
    6610.943     0.775000         3179         4.44
    6909.951     0.800000         3280         5.00
    7368.703     0.825000         3382         5.71
    7663.615     0.850000         3485         6.67
    7979.007     0.875000         3587         8.00
    8138.751     0.887500         3638         8.89
    8269.823     0.900000         3690        10.00
    8413.183     0.912500         3740        11.43
    8765.439     0.925000         3792        13.33
    9052.159     0.937500         3842        16.00
    9248.767     0.943750         3868        17.78
    9609.215     0.950000         3894        20.00
    9920.511     0.956250         3919        22.86
   10444.799     0.962500         3946        26.67
   10788.863     0.968750         3970        32.00
   10919.935     0.971875         3983        35.56
   11018.239     0.975000         3996        40.00
   11141.119     0.978125         4009        45.71
   11272.191     0.981250         4022        53.33
   11370.495     0.984375         4035        64.00
   11395.071     0.985938         4041        71.11
   11427.839     0.987500         4049        80.00
   11444.223     0.989062         4055        91.43
   11485.183     0.990625         4060       106.67
   11517.951     0.992188         4067       128.00
   11542.527     0.992969         4072       142.22
   11558.911     0.993750         4074       160.00
   11575.295     0.994531         4076       182.86
   11706.367     0.995313         4079       213.33
   12795.903     0.996094         4082       256.00
   12918.783     0.996484         4084       284.44
   13074.431     0.996875         4086       320.00
   13148.159     0.997266         4087       365.71
   13164.543     0.997656         4089       426.67
   13221.887     0.998047         4090       512.00
   13254.655     0.998242         4091       568.89
   13582.335     0.998437         4092       640.00
   13639.679     0.998633         4093       731.43
   13647.871     0.998828         4095       853.33
   13647.871     0.999023         4095      1024.00
   13647.871     0.999121         4095      1137.78
   13647.871     0.999219         4095      1280.00
   13680.639     0.999316         4096      1462.86
   13680.639     0.999414         4096      1706.67
   13680.639     0.999512         4096      2048.00
   13713.407     0.999561         4097      2275.56
   13713.407     0.999609         4097      2560.00
   13713.407     0.999658         4097      2925.71
   13713.407     0.999707         4097      3413.33
   13713.407     0.999756         4097      4096.00
   13770.751     0.999780         4098      4551.11
   13770.751     1.000000         4098          inf
#[Mean    =     4167.019, StdDeviation   =     2991.360]
#[Max     =    13762.560, Total count    =         4098]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5012 requests in 1.00m, 0.89MB read
  Non-2xx or 3xx responses: 35
Requests/sec:     83.52
Transfer/sec:     15.11KB