mediaMicroservices/wrk2/_60s_r60.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 168.816ms, rate sampling interval: 586ms
  Thread calibration: mean lat.: 161.693ms, rate sampling interval: 592ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   668.98ms  943.77ms   4.76s    87.03%
    Req/Sec    27.44      8.58    45.00     79.29%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  233.21ms
 75.000%  781.82ms
 90.000%    1.93s 
 99.000%    4.76s 
 99.900%    5.41s 
 99.990%    6.02s 
 99.999%    6.02s 
100.000%    6.02s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      60.799     0.000000            1         1.00
      89.087     0.100000          282         1.11
     107.391     0.200000          559         1.25
     136.191     0.300000          838         1.43
     173.311     0.400000         1120         1.67
     233.215     0.500000         1396         2.00
     276.479     0.550000         1536         2.22
     346.879     0.600000         1677         2.50
     440.063     0.650000         1815         2.86
     592.895     0.700000         1955         3.33
     781.823     0.750000         2094         4.00
     913.407     0.775000         2164         4.44
    1086.463     0.800000         2235         5.00
    1268.735     0.825000         2304         5.71
    1434.623     0.850000         2374         6.67
    1636.351     0.875000         2443         8.00
    1793.023     0.887500         2478         8.89
    1933.311     0.900000         2513        10.00
    2197.503     0.912500         2548        11.43
    2355.199     0.925000         2583        13.33
    2521.087     0.937500         2618        16.00
    2641.919     0.943750         2635        17.78
    2777.087     0.950000         2653        20.00
    2897.919     0.956250         2670        22.86
    3028.991     0.962500         2688        26.67
    3168.255     0.968750         2705        32.00
    3336.191     0.971875         2714        35.56
    3469.311     0.975000         2723        40.00
    3565.567     0.978125         2731        45.71
    3721.215     0.981250         2740        53.33
    4104.191     0.984375         2749        64.00
    4171.775     0.985938         2753        71.11
    4538.367     0.987500         2758        80.00
    4665.343     0.989062         2762        91.43
    4820.991     0.990625         2766       106.67
    4919.295     0.992188         2771       128.00
    4935.679     0.992969         2773       142.22
    4952.063     0.993750         2775       160.00
    5005.311     0.994531         2777       182.86
    5165.055     0.995313         2779       213.33
    5210.111     0.996094         2782       256.00
    5218.303     0.996484         2783       284.44
    5230.591     0.996875         2784       320.00
    5242.879     0.997266         2785       365.71
    5292.031     0.997656         2786       426.67
    5296.127     0.998047         2787       512.00
    5357.567     0.998242         2788       568.89
    5357.567     0.998437         2788       640.00
    5414.911     0.998633         2789       731.43
    5414.911     0.998828         2789       853.33
    5648.383     0.999023         2790      1024.00
    5648.383     0.999121         2790      1137.78
    5648.383     0.999219         2790      1280.00
    5697.535     0.999316         2791      1462.86
    5697.535     0.999414         2791      1706.67
    5697.535     0.999512         2791      2048.00
    5697.535     0.999561         2791      2275.56
    5697.535     0.999609         2791      2560.00
    6017.023     0.999658         2792      2925.71
    6017.023     1.000000         2792          inf
#[Mean    =      668.981, StdDeviation   =      943.770]
#[Max     =     6012.928, Total count    =         2792]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3430 requests in 1.00m, 619.88KB read
  Non-2xx or 3xx responses: 21
Requests/sec:     57.16
Transfer/sec:     10.33KB