mediaMicroservices/wrk2/_60s_r75.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 1139.059ms, rate sampling interval: 5185ms
  Thread calibration: mean lat.: 996.694ms, rate sampling interval: 5591ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.88s     1.68s    5.99s    66.94%
    Req/Sec    36.82      3.58    43.00     76.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.42s 
 75.000%    3.01s 
 90.000%    4.53s 
 99.000%    5.99s 
 99.900%    6.52s 
 99.990%    6.70s 
 99.999%    6.70s 
100.000%    6.70s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      67.135     0.000000            1         1.00
     148.095     0.100000          372         1.11
     243.839     0.200000          743         1.25
     476.159     0.300000         1114         1.43
     852.991     0.400000         1485         1.67
    1419.263     0.500000         1856         2.00
    1776.639     0.550000         2042         2.22
    2054.143     0.600000         2227         2.50
    2412.543     0.650000         2413         2.86
    2697.215     0.700000         2598         3.33
    3010.559     0.750000         2784         4.00
    3182.591     0.775000         2877         4.44
    3368.959     0.800000         2969         5.00
    3553.279     0.825000         3064         5.71
    3762.175     0.850000         3155         6.67
    4206.591     0.875000         3249         8.00
    4362.239     0.887500         3294         8.89
    4530.175     0.900000         3340        10.00
    4747.263     0.912500         3388        11.43
    4923.391     0.925000         3433        13.33
    5124.095     0.937500         3480        16.00
    5193.727     0.943750         3503        17.78
    5259.263     0.950000         3526        20.00
    5349.375     0.956250         3549        22.86
    5488.639     0.962500         3572        26.67
    5578.751     0.968750         3598        32.00
    5611.519     0.971875         3607        35.56
    5648.383     0.975000         3621        40.00
    5689.343     0.978125         3632        45.71
    5787.647     0.981250         3643        53.33
    5836.799     0.984375         3654        64.00
    5861.375     0.985938         3659        71.11
    5898.239     0.987500         3665        80.00
    5967.871     0.989062         3671        91.43
    6021.119     0.990625         3677       106.67
    6094.847     0.992188         3683       128.00
    6119.423     0.992969         3685       142.22
    6143.999     0.993750         3688       160.00
    6250.495     0.994531         3691       182.86
    6262.783     0.995313         3694       213.33
    6316.031     0.996094         3697       256.00
    6356.991     0.996484         3698       284.44
    6422.527     0.996875         3700       320.00
    6443.007     0.997266         3701       365.71
    6467.583     0.997656         3703       426.67
    6483.967     0.998047         3704       512.00
    6488.063     0.998242         3705       568.89
    6512.639     0.998437         3706       640.00
    6512.639     0.998633         3706       731.43
    6520.831     0.998828         3707       853.33
    6533.119     0.999023         3708      1024.00
    6533.119     0.999121         3708      1137.78
    6569.983     0.999219         3709      1280.00
    6569.983     0.999316         3709      1462.86
    6569.983     0.999414         3709      1706.67
    6586.367     0.999512         3710      2048.00
    6586.367     0.999561         3710      2275.56
    6586.367     0.999609         3710      2560.00
    6586.367     0.999658         3710      2925.71
    6586.367     0.999707         3710      3413.33
    6701.055     0.999756         3711      4096.00
    6701.055     1.000000         3711          inf
#[Mean    =     1878.015, StdDeviation   =     1681.172]
#[Max     =     6696.960, Total count    =         3711]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4279 requests in 1.00m, 770.91KB read
  Non-2xx or 3xx responses: 12
Requests/sec:     71.31
Transfer/sec:     12.85KB